name: "main"
layer {
  name: "inp_0"
  type: "input"
  top: "inp_0"
  layer_param {
    idx: 0
    output_0: "inp_0:0(input_0)<1,3,224,224|float32|NCHW>"
  }
}
layer {
  name: "conv2d"
  type: "nn_conv2d"
  top: "conv2d"
  bottom: "inp_0"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const(conv2d.weight)<64,3,7,7|float32|OIHW>"
    strides: "2,2"
    idx: 1
    padding: "3,3,3,3"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d:0<1,64,112,112|float32|NCHW>"
    input_0: "inp_0:0(input_0)<1,3,224,224|float32|NCHW>"
  }
}
layer {
  name: "batch_norm"
  type: "nn_batch_norm"
  top: "batch_norm"
  bottom: "conv2d"
  layer_param {
    input_0: "conv2d:0<1,64,112,112|float32|NCHW>"
    center: "1"
    param_beta: "const_2(batch_norm.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_4(batch_norm.running_var)<64|float32|O>"
    idx: 2
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_1(batch_norm.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm:0<1,64,112,112|float32|NCHW>"
    param_mean: "const_3(batch_norm.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm.0"
  type: "get_item"
  top: "batch_norm.0"
  bottom: "batch_norm"
  layer_param {
    idx: 3
    input_0: "batch_norm:0<1,64,112,112|float32|NCHW>"
    output_0: "batch_norm.0:0<1,64,112,112|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu"
  type: "nn_relu"
  top: "relu"
  bottom: "batch_norm.0"
  layer_param {
    idx: 4
    input_0: "batch_norm.0:0<1,64,112,112|float32|NCHW>"
    output_0: "relu:0<1,64,112,112|float32|NCHW>"
  }
}
layer {
  name: "max_pool2d"
  type: "nn_max_pool2d"
  top: "max_pool2d"
  bottom: "relu"
  layer_param {
    out_layout: "NCHW"
    strides: "2,2"
    pool_size: "3,3"
    ceil_mode: "0"
    idx: 5
    padding: "1,1,1,1"
    layout: "NCHW"
    dilation: "1,1"
    output_0: "max_pool2d:0<1,64,56,56|float32|NCHW>"
    input_0: "relu:0<1,64,112,112|float32|NCHW>"
  }
}
layer {
  name: "conv2d_1"
  type: "nn_conv2d"
  top: "conv2d_1"
  bottom: "max_pool2d"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_5(conv2d_1.weight)<64,64,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 6
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_1:0<1,64,56,56|float32|NCHW>"
    input_0: "max_pool2d:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_1"
  type: "nn_batch_norm"
  top: "batch_norm_1"
  bottom: "conv2d_1"
  layer_param {
    input_0: "conv2d_1:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_7(batch_norm_1.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_9(batch_norm_1.running_var)<64|float32|O>"
    idx: 7
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_6(batch_norm_1.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_1:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_8(batch_norm_1.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_1.0"
  type: "get_item"
  top: "batch_norm_1.0"
  bottom: "batch_norm_1"
  layer_param {
    idx: 8
    input_0: "batch_norm_1:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_1.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_1"
  type: "nn_relu"
  top: "relu_1"
  bottom: "batch_norm_1.0"
  layer_param {
    idx: 9
    input_0: "batch_norm_1.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_1:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_2"
  type: "nn_conv2d"
  top: "conv2d_2"
  bottom: "relu_1"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_10(conv2d_2.weight)<64,64,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 10
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_2:0<1,64,56,56|float32|NCHW>"
    input_0: "relu_1:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_2"
  type: "nn_batch_norm"
  top: "batch_norm_2"
  bottom: "conv2d_2"
  layer_param {
    input_0: "conv2d_2:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_12(batch_norm_2.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_14(batch_norm_2.running_var)<64|float32|O>"
    idx: 11
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_11(batch_norm_2.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_2:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_13(batch_norm_2.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_2.0"
  type: "get_item"
  top: "batch_norm_2.0"
  bottom: "batch_norm_2"
  layer_param {
    idx: 12
    input_0: "batch_norm_2:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_2.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_2"
  type: "nn_relu"
  top: "relu_2"
  bottom: "batch_norm_2.0"
  layer_param {
    idx: 13
    input_0: "batch_norm_2.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_2:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_3"
  type: "nn_conv2d"
  top: "conv2d_3"
  bottom: "relu_2"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_15(conv2d_3.weight)<256,64,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 14
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_3:0<1,256,56,56|float32|NCHW>"
    input_0: "relu_2:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_3"
  type: "nn_batch_norm"
  top: "batch_norm_3"
  bottom: "conv2d_3"
  layer_param {
    input_0: "conv2d_3:0<1,256,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_17(batch_norm_3.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_19(batch_norm_3.running_var)<256|float32|O>"
    idx: 15
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_16(batch_norm_3.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_3:0<1,256,56,56|float32|NCHW>"
    param_mean: "const_18(batch_norm_3.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_3.0"
  type: "get_item"
  top: "batch_norm_3.0"
  bottom: "batch_norm_3"
  layer_param {
    idx: 16
    input_0: "batch_norm_3:0<1,256,56,56|float32|NCHW>"
    output_0: "batch_norm_3.0:0<1,256,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "conv2d_4"
  type: "nn_conv2d"
  top: "conv2d_4"
  bottom: "max_pool2d"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_20(conv2d_4.weight)<256,64,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 17
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_4:0<1,256,56,56|float32|NCHW>"
    input_0: "max_pool2d:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_4"
  type: "nn_batch_norm"
  top: "batch_norm_4"
  bottom: "conv2d_4"
  layer_param {
    input_0: "conv2d_4:0<1,256,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_22(batch_norm_4.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_24(batch_norm_4.running_var)<256|float32|O>"
    idx: 18
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_21(batch_norm_4.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_4:0<1,256,56,56|float32|NCHW>"
    param_mean: "const_23(batch_norm_4.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_4.0"
  type: "get_item"
  top: "batch_norm_4.0"
  bottom: "batch_norm_4"
  layer_param {
    idx: 19
    input_0: "batch_norm_4:0<1,256,56,56|float32|NCHW>"
    output_0: "batch_norm_4.0:0<1,256,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add"
  type: "add"
  top: "add"
  bottom: "batch_norm_3.0"
  bottom: "batch_norm_4.0"
  layer_param {
    idx: 20
    input_0: "batch_norm_3.0:0<1,256,56,56|float32|NCHW>"
    input_1: "batch_norm_4.0:0<1,256,56,56|float32|NCHW>"
    output_0: "add:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "relu_3"
  type: "nn_relu"
  top: "relu_3"
  bottom: "add"
  layer_param {
    idx: 21
    input_0: "add:0<1,256,56,56|float32|NCHW>"
    output_0: "relu_3:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_5"
  type: "nn_conv2d"
  top: "conv2d_5"
  bottom: "relu_3"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_25(conv2d_5.weight)<64,256,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 22
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_5:0<1,64,56,56|float32|NCHW>"
    input_0: "relu_3:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_5"
  type: "nn_batch_norm"
  top: "batch_norm_5"
  bottom: "conv2d_5"
  layer_param {
    input_0: "conv2d_5:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_27(batch_norm_5.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_29(batch_norm_5.running_var)<64|float32|O>"
    idx: 23
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_26(batch_norm_5.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_5:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_28(batch_norm_5.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_5.0"
  type: "get_item"
  top: "batch_norm_5.0"
  bottom: "batch_norm_5"
  layer_param {
    idx: 24
    input_0: "batch_norm_5:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_5.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_4"
  type: "nn_relu"
  top: "relu_4"
  bottom: "batch_norm_5.0"
  layer_param {
    idx: 25
    input_0: "batch_norm_5.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_4:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_6"
  type: "nn_conv2d"
  top: "conv2d_6"
  bottom: "relu_4"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_30(conv2d_6.weight)<64,64,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 26
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_6:0<1,64,56,56|float32|NCHW>"
    input_0: "relu_4:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_6"
  type: "nn_batch_norm"
  top: "batch_norm_6"
  bottom: "conv2d_6"
  layer_param {
    input_0: "conv2d_6:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_32(batch_norm_6.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_34(batch_norm_6.running_var)<64|float32|O>"
    idx: 27
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_31(batch_norm_6.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_6:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_33(batch_norm_6.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_6.0"
  type: "get_item"
  top: "batch_norm_6.0"
  bottom: "batch_norm_6"
  layer_param {
    idx: 28
    input_0: "batch_norm_6:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_6.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_5"
  type: "nn_relu"
  top: "relu_5"
  bottom: "batch_norm_6.0"
  layer_param {
    idx: 29
    input_0: "batch_norm_6.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_5:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_7"
  type: "nn_conv2d"
  top: "conv2d_7"
  bottom: "relu_5"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_35(conv2d_7.weight)<256,64,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 30
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_7:0<1,256,56,56|float32|NCHW>"
    input_0: "relu_5:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_7"
  type: "nn_batch_norm"
  top: "batch_norm_7"
  bottom: "conv2d_7"
  layer_param {
    input_0: "conv2d_7:0<1,256,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_37(batch_norm_7.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_39(batch_norm_7.running_var)<256|float32|O>"
    idx: 31
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_36(batch_norm_7.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_7:0<1,256,56,56|float32|NCHW>"
    param_mean: "const_38(batch_norm_7.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_7.0"
  type: "get_item"
  top: "batch_norm_7.0"
  bottom: "batch_norm_7"
  layer_param {
    idx: 32
    input_0: "batch_norm_7:0<1,256,56,56|float32|NCHW>"
    output_0: "batch_norm_7.0:0<1,256,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_1"
  type: "add"
  top: "add_1"
  bottom: "batch_norm_7.0"
  bottom: "relu_3"
  layer_param {
    idx: 33
    input_0: "batch_norm_7.0:0<1,256,56,56|float32|NCHW>"
    input_1: "relu_3:0<1,256,56,56|float32|NCHW>"
    output_0: "add_1:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "relu_6"
  type: "nn_relu"
  top: "relu_6"
  bottom: "add_1"
  layer_param {
    idx: 34
    input_0: "add_1:0<1,256,56,56|float32|NCHW>"
    output_0: "relu_6:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_8"
  type: "nn_conv2d"
  top: "conv2d_8"
  bottom: "relu_6"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_40(conv2d_8.weight)<64,256,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 35
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_8:0<1,64,56,56|float32|NCHW>"
    input_0: "relu_6:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_8"
  type: "nn_batch_norm"
  top: "batch_norm_8"
  bottom: "conv2d_8"
  layer_param {
    input_0: "conv2d_8:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_42(batch_norm_8.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_44(batch_norm_8.running_var)<64|float32|O>"
    idx: 36
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_41(batch_norm_8.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_8:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_43(batch_norm_8.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_8.0"
  type: "get_item"
  top: "batch_norm_8.0"
  bottom: "batch_norm_8"
  layer_param {
    idx: 37
    input_0: "batch_norm_8:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_8.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_7"
  type: "nn_relu"
  top: "relu_7"
  bottom: "batch_norm_8.0"
  layer_param {
    idx: 38
    input_0: "batch_norm_8.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_7:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_9"
  type: "nn_conv2d"
  top: "conv2d_9"
  bottom: "relu_7"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_45(conv2d_9.weight)<64,64,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 39
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_9:0<1,64,56,56|float32|NCHW>"
    input_0: "relu_7:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_9"
  type: "nn_batch_norm"
  top: "batch_norm_9"
  bottom: "conv2d_9"
  layer_param {
    input_0: "conv2d_9:0<1,64,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_47(batch_norm_9.bias)<64|float32|O>"
    axis: "1"
    param_var: "const_49(batch_norm_9.running_var)<64|float32|O>"
    idx: 40
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_46(batch_norm_9.weight)<64|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_9:0<1,64,56,56|float32|NCHW>"
    param_mean: "const_48(batch_norm_9.running_mean)<64|float32|O>"
  }
}
layer {
  name: "batch_norm_9.0"
  type: "get_item"
  top: "batch_norm_9.0"
  bottom: "batch_norm_9"
  layer_param {
    idx: 41
    input_0: "batch_norm_9:0<1,64,56,56|float32|NCHW>"
    output_0: "batch_norm_9.0:0<1,64,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_8"
  type: "nn_relu"
  top: "relu_8"
  bottom: "batch_norm_9.0"
  layer_param {
    idx: 42
    input_0: "batch_norm_9.0:0<1,64,56,56|float32|NCHW>"
    output_0: "relu_8:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_10"
  type: "nn_conv2d"
  top: "conv2d_10"
  bottom: "relu_8"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_50(conv2d_10.weight)<256,64,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 43
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_10:0<1,256,56,56|float32|NCHW>"
    input_0: "relu_8:0<1,64,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_10"
  type: "nn_batch_norm"
  top: "batch_norm_10"
  bottom: "conv2d_10"
  layer_param {
    input_0: "conv2d_10:0<1,256,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_52(batch_norm_10.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_54(batch_norm_10.running_var)<256|float32|O>"
    idx: 44
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_51(batch_norm_10.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_10:0<1,256,56,56|float32|NCHW>"
    param_mean: "const_53(batch_norm_10.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_10.0"
  type: "get_item"
  top: "batch_norm_10.0"
  bottom: "batch_norm_10"
  layer_param {
    idx: 45
    input_0: "batch_norm_10:0<1,256,56,56|float32|NCHW>"
    output_0: "batch_norm_10.0:0<1,256,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_2"
  type: "add"
  top: "add_2"
  bottom: "batch_norm_10.0"
  bottom: "relu_6"
  layer_param {
    idx: 46
    input_0: "batch_norm_10.0:0<1,256,56,56|float32|NCHW>"
    input_1: "relu_6:0<1,256,56,56|float32|NCHW>"
    output_0: "add_2:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "relu_9"
  type: "nn_relu"
  top: "relu_9"
  bottom: "add_2"
  layer_param {
    idx: 47
    input_0: "add_2:0<1,256,56,56|float32|NCHW>"
    output_0: "relu_9:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_11"
  type: "nn_conv2d"
  top: "conv2d_11"
  bottom: "relu_9"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_55(conv2d_11.weight)<128,256,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 48
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_11:0<1,128,56,56|float32|NCHW>"
    input_0: "relu_9:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_11"
  type: "nn_batch_norm"
  top: "batch_norm_11"
  bottom: "conv2d_11"
  layer_param {
    input_0: "conv2d_11:0<1,128,56,56|float32|NCHW>"
    center: "1"
    param_beta: "const_57(batch_norm_11.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_59(batch_norm_11.running_var)<128|float32|O>"
    idx: 49
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_56(batch_norm_11.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_11:0<1,128,56,56|float32|NCHW>"
    param_mean: "const_58(batch_norm_11.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_11.0"
  type: "get_item"
  top: "batch_norm_11.0"
  bottom: "batch_norm_11"
  layer_param {
    idx: 50
    input_0: "batch_norm_11:0<1,128,56,56|float32|NCHW>"
    output_0: "batch_norm_11.0:0<1,128,56,56|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_10"
  type: "nn_relu"
  top: "relu_10"
  bottom: "batch_norm_11.0"
  layer_param {
    idx: 51
    input_0: "batch_norm_11.0:0<1,128,56,56|float32|NCHW>"
    output_0: "relu_10:0<1,128,56,56|float32|NCHW>"
  }
}
layer {
  name: "conv2d_12"
  type: "nn_conv2d"
  top: "conv2d_12"
  bottom: "relu_10"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_60(conv2d_12.weight)<128,128,3,3|float32|OIHW>"
    strides: "2,2"
    idx: 52
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_12:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_10:0<1,128,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_12"
  type: "nn_batch_norm"
  top: "batch_norm_12"
  bottom: "conv2d_12"
  layer_param {
    input_0: "conv2d_12:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_62(batch_norm_12.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_64(batch_norm_12.running_var)<128|float32|O>"
    idx: 53
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_61(batch_norm_12.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_12:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_63(batch_norm_12.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_12.0"
  type: "get_item"
  top: "batch_norm_12.0"
  bottom: "batch_norm_12"
  layer_param {
    idx: 54
    input_0: "batch_norm_12:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_12.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_11"
  type: "nn_relu"
  top: "relu_11"
  bottom: "batch_norm_12.0"
  layer_param {
    idx: 55
    input_0: "batch_norm_12.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_11:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_13"
  type: "nn_conv2d"
  top: "conv2d_13"
  bottom: "relu_11"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_65(conv2d_13.weight)<512,128,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 56
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_13:0<1,512,28,28|float32|NCHW>"
    input_0: "relu_11:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_13"
  type: "nn_batch_norm"
  top: "batch_norm_13"
  bottom: "conv2d_13"
  layer_param {
    input_0: "conv2d_13:0<1,512,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_67(batch_norm_13.bias)<512|float32|O>"
    axis: "1"
    param_var: "const_69(batch_norm_13.running_var)<512|float32|O>"
    idx: 57
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_66(batch_norm_13.weight)<512|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_13:0<1,512,28,28|float32|NCHW>"
    param_mean: "const_68(batch_norm_13.running_mean)<512|float32|O>"
  }
}
layer {
  name: "batch_norm_13.0"
  type: "get_item"
  top: "batch_norm_13.0"
  bottom: "batch_norm_13"
  layer_param {
    idx: 58
    input_0: "batch_norm_13:0<1,512,28,28|float32|NCHW>"
    output_0: "batch_norm_13.0:0<1,512,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "conv2d_14"
  type: "nn_conv2d"
  top: "conv2d_14"
  bottom: "relu_9"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_70(conv2d_14.weight)<512,256,1,1|float32|OIHW>"
    strides: "2,2"
    idx: 59
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_14:0<1,512,28,28|float32|NCHW>"
    input_0: "relu_9:0<1,256,56,56|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_14"
  type: "nn_batch_norm"
  top: "batch_norm_14"
  bottom: "conv2d_14"
  layer_param {
    input_0: "conv2d_14:0<1,512,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_72(batch_norm_14.bias)<512|float32|O>"
    axis: "1"
    param_var: "const_74(batch_norm_14.running_var)<512|float32|O>"
    idx: 60
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_71(batch_norm_14.weight)<512|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_14:0<1,512,28,28|float32|NCHW>"
    param_mean: "const_73(batch_norm_14.running_mean)<512|float32|O>"
  }
}
layer {
  name: "batch_norm_14.0"
  type: "get_item"
  top: "batch_norm_14.0"
  bottom: "batch_norm_14"
  layer_param {
    idx: 61
    input_0: "batch_norm_14:0<1,512,28,28|float32|NCHW>"
    output_0: "batch_norm_14.0:0<1,512,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_3"
  type: "add"
  top: "add_3"
  bottom: "batch_norm_13.0"
  bottom: "batch_norm_14.0"
  layer_param {
    idx: 62
    input_0: "batch_norm_13.0:0<1,512,28,28|float32|NCHW>"
    input_1: "batch_norm_14.0:0<1,512,28,28|float32|NCHW>"
    output_0: "add_3:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "relu_12"
  type: "nn_relu"
  top: "relu_12"
  bottom: "add_3"
  layer_param {
    idx: 63
    input_0: "add_3:0<1,512,28,28|float32|NCHW>"
    output_0: "relu_12:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_15"
  type: "nn_conv2d"
  top: "conv2d_15"
  bottom: "relu_12"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_75(conv2d_15.weight)<128,512,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 64
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_15:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_12:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_15"
  type: "nn_batch_norm"
  top: "batch_norm_15"
  bottom: "conv2d_15"
  layer_param {
    input_0: "conv2d_15:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_77(batch_norm_15.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_79(batch_norm_15.running_var)<128|float32|O>"
    idx: 65
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_76(batch_norm_15.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_15:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_78(batch_norm_15.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_15.0"
  type: "get_item"
  top: "batch_norm_15.0"
  bottom: "batch_norm_15"
  layer_param {
    idx: 66
    input_0: "batch_norm_15:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_15.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_13"
  type: "nn_relu"
  top: "relu_13"
  bottom: "batch_norm_15.0"
  layer_param {
    idx: 67
    input_0: "batch_norm_15.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_13:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_16"
  type: "nn_conv2d"
  top: "conv2d_16"
  bottom: "relu_13"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_80(conv2d_16.weight)<128,128,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 68
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_16:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_13:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_16"
  type: "nn_batch_norm"
  top: "batch_norm_16"
  bottom: "conv2d_16"
  layer_param {
    input_0: "conv2d_16:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_82(batch_norm_16.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_84(batch_norm_16.running_var)<128|float32|O>"
    idx: 69
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_81(batch_norm_16.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_16:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_83(batch_norm_16.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_16.0"
  type: "get_item"
  top: "batch_norm_16.0"
  bottom: "batch_norm_16"
  layer_param {
    idx: 70
    input_0: "batch_norm_16:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_16.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_14"
  type: "nn_relu"
  top: "relu_14"
  bottom: "batch_norm_16.0"
  layer_param {
    idx: 71
    input_0: "batch_norm_16.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_14:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_17"
  type: "nn_conv2d"
  top: "conv2d_17"
  bottom: "relu_14"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_85(conv2d_17.weight)<512,128,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 72
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_17:0<1,512,28,28|float32|NCHW>"
    input_0: "relu_14:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_17"
  type: "nn_batch_norm"
  top: "batch_norm_17"
  bottom: "conv2d_17"
  layer_param {
    input_0: "conv2d_17:0<1,512,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_87(batch_norm_17.bias)<512|float32|O>"
    axis: "1"
    param_var: "const_89(batch_norm_17.running_var)<512|float32|O>"
    idx: 73
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_86(batch_norm_17.weight)<512|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_17:0<1,512,28,28|float32|NCHW>"
    param_mean: "const_88(batch_norm_17.running_mean)<512|float32|O>"
  }
}
layer {
  name: "batch_norm_17.0"
  type: "get_item"
  top: "batch_norm_17.0"
  bottom: "batch_norm_17"
  layer_param {
    idx: 74
    input_0: "batch_norm_17:0<1,512,28,28|float32|NCHW>"
    output_0: "batch_norm_17.0:0<1,512,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_4"
  type: "add"
  top: "add_4"
  bottom: "batch_norm_17.0"
  bottom: "relu_12"
  layer_param {
    idx: 75
    input_0: "batch_norm_17.0:0<1,512,28,28|float32|NCHW>"
    input_1: "relu_12:0<1,512,28,28|float32|NCHW>"
    output_0: "add_4:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "relu_15"
  type: "nn_relu"
  top: "relu_15"
  bottom: "add_4"
  layer_param {
    idx: 76
    input_0: "add_4:0<1,512,28,28|float32|NCHW>"
    output_0: "relu_15:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_18"
  type: "nn_conv2d"
  top: "conv2d_18"
  bottom: "relu_15"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_90(conv2d_18.weight)<128,512,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 77
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_18:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_15:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_18"
  type: "nn_batch_norm"
  top: "batch_norm_18"
  bottom: "conv2d_18"
  layer_param {
    input_0: "conv2d_18:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_92(batch_norm_18.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_94(batch_norm_18.running_var)<128|float32|O>"
    idx: 78
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_91(batch_norm_18.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_18:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_93(batch_norm_18.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_18.0"
  type: "get_item"
  top: "batch_norm_18.0"
  bottom: "batch_norm_18"
  layer_param {
    idx: 79
    input_0: "batch_norm_18:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_18.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_16"
  type: "nn_relu"
  top: "relu_16"
  bottom: "batch_norm_18.0"
  layer_param {
    idx: 80
    input_0: "batch_norm_18.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_16:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_19"
  type: "nn_conv2d"
  top: "conv2d_19"
  bottom: "relu_16"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_95(conv2d_19.weight)<128,128,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 81
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_19:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_16:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_19"
  type: "nn_batch_norm"
  top: "batch_norm_19"
  bottom: "conv2d_19"
  layer_param {
    input_0: "conv2d_19:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_97(batch_norm_19.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_99(batch_norm_19.running_var)<128|float32|O>"
    idx: 82
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_96(batch_norm_19.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_19:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_98(batch_norm_19.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_19.0"
  type: "get_item"
  top: "batch_norm_19.0"
  bottom: "batch_norm_19"
  layer_param {
    idx: 83
    input_0: "batch_norm_19:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_19.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_17"
  type: "nn_relu"
  top: "relu_17"
  bottom: "batch_norm_19.0"
  layer_param {
    idx: 84
    input_0: "batch_norm_19.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_17:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_20"
  type: "nn_conv2d"
  top: "conv2d_20"
  bottom: "relu_17"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_100(conv2d_20.weight)<512,128,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 85
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_20:0<1,512,28,28|float32|NCHW>"
    input_0: "relu_17:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_20"
  type: "nn_batch_norm"
  top: "batch_norm_20"
  bottom: "conv2d_20"
  layer_param {
    input_0: "conv2d_20:0<1,512,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_102(batch_norm_20.bias)<512|float32|O>"
    axis: "1"
    param_var: "const_104(batch_norm_20.running_var)<512|float32|O>"
    idx: 86
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_101(batch_norm_20.weight)<512|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_20:0<1,512,28,28|float32|NCHW>"
    param_mean: "const_103(batch_norm_20.running_mean)<512|float32|O>"
  }
}
layer {
  name: "batch_norm_20.0"
  type: "get_item"
  top: "batch_norm_20.0"
  bottom: "batch_norm_20"
  layer_param {
    idx: 87
    input_0: "batch_norm_20:0<1,512,28,28|float32|NCHW>"
    output_0: "batch_norm_20.0:0<1,512,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_5"
  type: "add"
  top: "add_5"
  bottom: "batch_norm_20.0"
  bottom: "relu_15"
  layer_param {
    idx: 88
    input_0: "batch_norm_20.0:0<1,512,28,28|float32|NCHW>"
    input_1: "relu_15:0<1,512,28,28|float32|NCHW>"
    output_0: "add_5:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "relu_18"
  type: "nn_relu"
  top: "relu_18"
  bottom: "add_5"
  layer_param {
    idx: 89
    input_0: "add_5:0<1,512,28,28|float32|NCHW>"
    output_0: "relu_18:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_21"
  type: "nn_conv2d"
  top: "conv2d_21"
  bottom: "relu_18"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_105(conv2d_21.weight)<128,512,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 90
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_21:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_18:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_21"
  type: "nn_batch_norm"
  top: "batch_norm_21"
  bottom: "conv2d_21"
  layer_param {
    input_0: "conv2d_21:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_107(batch_norm_21.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_109(batch_norm_21.running_var)<128|float32|O>"
    idx: 91
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_106(batch_norm_21.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_21:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_108(batch_norm_21.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_21.0"
  type: "get_item"
  top: "batch_norm_21.0"
  bottom: "batch_norm_21"
  layer_param {
    idx: 92
    input_0: "batch_norm_21:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_21.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_19"
  type: "nn_relu"
  top: "relu_19"
  bottom: "batch_norm_21.0"
  layer_param {
    idx: 93
    input_0: "batch_norm_21.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_19:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_22"
  type: "nn_conv2d"
  top: "conv2d_22"
  bottom: "relu_19"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_110(conv2d_22.weight)<128,128,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 94
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_22:0<1,128,28,28|float32|NCHW>"
    input_0: "relu_19:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_22"
  type: "nn_batch_norm"
  top: "batch_norm_22"
  bottom: "conv2d_22"
  layer_param {
    input_0: "conv2d_22:0<1,128,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_112(batch_norm_22.bias)<128|float32|O>"
    axis: "1"
    param_var: "const_114(batch_norm_22.running_var)<128|float32|O>"
    idx: 95
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_111(batch_norm_22.weight)<128|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_22:0<1,128,28,28|float32|NCHW>"
    param_mean: "const_113(batch_norm_22.running_mean)<128|float32|O>"
  }
}
layer {
  name: "batch_norm_22.0"
  type: "get_item"
  top: "batch_norm_22.0"
  bottom: "batch_norm_22"
  layer_param {
    idx: 96
    input_0: "batch_norm_22:0<1,128,28,28|float32|NCHW>"
    output_0: "batch_norm_22.0:0<1,128,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_20"
  type: "nn_relu"
  top: "relu_20"
  bottom: "batch_norm_22.0"
  layer_param {
    idx: 97
    input_0: "batch_norm_22.0:0<1,128,28,28|float32|NCHW>"
    output_0: "relu_20:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_23"
  type: "nn_conv2d"
  top: "conv2d_23"
  bottom: "relu_20"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_115(conv2d_23.weight)<512,128,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 98
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_23:0<1,512,28,28|float32|NCHW>"
    input_0: "relu_20:0<1,128,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_23"
  type: "nn_batch_norm"
  top: "batch_norm_23"
  bottom: "conv2d_23"
  layer_param {
    input_0: "conv2d_23:0<1,512,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_117(batch_norm_23.bias)<512|float32|O>"
    axis: "1"
    param_var: "const_119(batch_norm_23.running_var)<512|float32|O>"
    idx: 99
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_116(batch_norm_23.weight)<512|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_23:0<1,512,28,28|float32|NCHW>"
    param_mean: "const_118(batch_norm_23.running_mean)<512|float32|O>"
  }
}
layer {
  name: "batch_norm_23.0"
  type: "get_item"
  top: "batch_norm_23.0"
  bottom: "batch_norm_23"
  layer_param {
    idx: 100
    input_0: "batch_norm_23:0<1,512,28,28|float32|NCHW>"
    output_0: "batch_norm_23.0:0<1,512,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_6"
  type: "add"
  top: "add_6"
  bottom: "batch_norm_23.0"
  bottom: "relu_18"
  layer_param {
    idx: 101
    input_0: "batch_norm_23.0:0<1,512,28,28|float32|NCHW>"
    input_1: "relu_18:0<1,512,28,28|float32|NCHW>"
    output_0: "add_6:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "relu_21"
  type: "nn_relu"
  top: "relu_21"
  bottom: "add_6"
  layer_param {
    idx: 102
    input_0: "add_6:0<1,512,28,28|float32|NCHW>"
    output_0: "relu_21:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_24"
  type: "nn_conv2d"
  top: "conv2d_24"
  bottom: "relu_21"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_120(conv2d_24.weight)<256,512,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 103
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_24:0<1,256,28,28|float32|NCHW>"
    input_0: "relu_21:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_24"
  type: "nn_batch_norm"
  top: "batch_norm_24"
  bottom: "conv2d_24"
  layer_param {
    input_0: "conv2d_24:0<1,256,28,28|float32|NCHW>"
    center: "1"
    param_beta: "const_122(batch_norm_24.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_124(batch_norm_24.running_var)<256|float32|O>"
    idx: 104
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_121(batch_norm_24.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_24:0<1,256,28,28|float32|NCHW>"
    param_mean: "const_123(batch_norm_24.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_24.0"
  type: "get_item"
  top: "batch_norm_24.0"
  bottom: "batch_norm_24"
  layer_param {
    idx: 105
    input_0: "batch_norm_24:0<1,256,28,28|float32|NCHW>"
    output_0: "batch_norm_24.0:0<1,256,28,28|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_22"
  type: "nn_relu"
  top: "relu_22"
  bottom: "batch_norm_24.0"
  layer_param {
    idx: 106
    input_0: "batch_norm_24.0:0<1,256,28,28|float32|NCHW>"
    output_0: "relu_22:0<1,256,28,28|float32|NCHW>"
  }
}
layer {
  name: "conv2d_25"
  type: "nn_conv2d"
  top: "conv2d_25"
  bottom: "relu_22"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_125(conv2d_25.weight)<256,256,3,3|float32|OIHW>"
    strides: "2,2"
    idx: 107
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_25:0<1,256,14,14|float32|NCHW>"
    input_0: "relu_22:0<1,256,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_25"
  type: "nn_batch_norm"
  top: "batch_norm_25"
  bottom: "conv2d_25"
  layer_param {
    input_0: "conv2d_25:0<1,256,14,14|float32|NCHW>"
    center: "1"
    param_beta: "const_127(batch_norm_25.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_129(batch_norm_25.running_var)<256|float32|O>"
    idx: 108
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_126(batch_norm_25.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_25:0<1,256,14,14|float32|NCHW>"
    param_mean: "const_128(batch_norm_25.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_25.0"
  type: "get_item"
  top: "batch_norm_25.0"
  bottom: "batch_norm_25"
  layer_param {
    idx: 109
    input_0: "batch_norm_25:0<1,256,14,14|float32|NCHW>"
    output_0: "batch_norm_25.0:0<1,256,14,14|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_23"
  type: "nn_relu"
  top: "relu_23"
  bottom: "batch_norm_25.0"
  layer_param {
    idx: 110
    input_0: "batch_norm_25.0:0<1,256,14,14|float32|NCHW>"
    output_0: "relu_23:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "conv2d_26"
  type: "nn_conv2d"
  top: "conv2d_26"
  bottom: "relu_23"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_130(conv2d_26.weight)<1024,256,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 111
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_26:0<1,1024,14,14|float32|NCHW>"
    input_0: "relu_23:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_26"
  type: "nn_batch_norm"
  top: "batch_norm_26"
  bottom: "conv2d_26"
  layer_param {
    input_0: "conv2d_26:0<1,1024,14,14|float32|NCHW>"
    center: "1"
    param_beta: "const_132(batch_norm_26.bias)<1024|float32|O>"
    axis: "1"
    param_var: "const_134(batch_norm_26.running_var)<1024|float32|O>"
    idx: 112
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_131(batch_norm_26.weight)<1024|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_26:0<1,1024,14,14|float32|NCHW>"
    param_mean: "const_133(batch_norm_26.running_mean)<1024|float32|O>"
  }
}
layer {
  name: "batch_norm_26.0"
  type: "get_item"
  top: "batch_norm_26.0"
  bottom: "batch_norm_26"
  layer_param {
    idx: 113
    input_0: "batch_norm_26:0<1,1024,14,14|float32|NCHW>"
    output_0: "batch_norm_26.0:0<1,1024,14,14|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "conv2d_27"
  type: "nn_conv2d"
  top: "conv2d_27"
  bottom: "relu_21"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_135(conv2d_27.weight)<1024,512,1,1|float32|OIHW>"
    strides: "2,2"
    idx: 114
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_27:0<1,1024,14,14|float32|NCHW>"
    input_0: "relu_21:0<1,512,28,28|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_27"
  type: "nn_batch_norm"
  top: "batch_norm_27"
  bottom: "conv2d_27"
  layer_param {
    input_0: "conv2d_27:0<1,1024,14,14|float32|NCHW>"
    center: "1"
    param_beta: "const_137(batch_norm_27.bias)<1024|float32|O>"
    axis: "1"
    param_var: "const_139(batch_norm_27.running_var)<1024|float32|O>"
    idx: 115
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_136(batch_norm_27.weight)<1024|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_27:0<1,1024,14,14|float32|NCHW>"
    param_mean: "const_138(batch_norm_27.running_mean)<1024|float32|O>"
  }
}
layer {
  name: "batch_norm_27.0"
  type: "get_item"
  top: "batch_norm_27.0"
  bottom: "batch_norm_27"
  layer_param {
    idx: 116
    input_0: "batch_norm_27:0<1,1024,14,14|float32|NCHW>"
    output_0: "batch_norm_27.0:0<1,1024,14,14|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "add_7"
  type: "add"
  top: "add_7"
  bottom: "batch_norm_26.0"
  bottom: "batch_norm_27.0"
  layer_param {
    idx: 117
    input_0: "batch_norm_26.0:0<1,1024,14,14|float32|NCHW>"
    input_1: "batch_norm_27.0:0<1,1024,14,14|float32|NCHW>"
    output_0: "add_7:0<1,1024,14,14|float32|NCHW>"
  }
}
layer {
  name: "relu_24"
  type: "nn_relu"
  top: "relu_24"
  bottom: "add_7"
  layer_param {
    idx: 118
    input_0: "add_7:0<1,1024,14,14|float32|NCHW>"
    output_0: "relu_24:0<1,1024,14,14|float32|NCHW>"
  }
}
layer {
  name: "conv2d_28"
  type: "nn_conv2d"
  top: "conv2d_28"
  bottom: "relu_24"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_140(conv2d_28.weight)<256,1024,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 119
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_28:0<1,256,14,14|float32|NCHW>"
    input_0: "relu_24:0<1,1024,14,14|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_28"
  type: "nn_batch_norm"
  top: "batch_norm_28"
  bottom: "conv2d_28"
  layer_param {
    input_0: "conv2d_28:0<1,256,14,14|float32|NCHW>"
    center: "1"
    param_beta: "const_142(batch_norm_28.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_144(batch_norm_28.running_var)<256|float32|O>"
    idx: 120
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_141(batch_norm_28.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_28:0<1,256,14,14|float32|NCHW>"
    param_mean: "const_143(batch_norm_28.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_28.0"
  type: "get_item"
  top: "batch_norm_28.0"
  bottom: "batch_norm_28"
  layer_param {
    idx: 121
    input_0: "batch_norm_28:0<1,256,14,14|float32|NCHW>"
    output_0: "batch_norm_28.0:0<1,256,14,14|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_25"
  type: "nn_relu"
  top: "relu_25"
  bottom: "batch_norm_28.0"
  layer_param {
    idx: 122
    input_0: "batch_norm_28.0:0<1,256,14,14|float32|NCHW>"
    output_0: "relu_25:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "conv2d_29"
  type: "nn_conv2d"
  top: "conv2d_29"
  bottom: "relu_25"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_145(conv2d_29.weight)<256,256,3,3|float32|OIHW>"
    strides: "1,1"
    idx: 123
    padding: "1,1,1,1"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_29:0<1,256,14,14|float32|NCHW>"
    input_0: "relu_25:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_29"
  type: "nn_batch_norm"
  top: "batch_norm_29"
  bottom: "conv2d_29"
  layer_param {
    input_0: "conv2d_29:0<1,256,14,14|float32|NCHW>"
    center: "1"
    param_beta: "const_147(batch_norm_29.bias)<256|float32|O>"
    axis: "1"
    param_var: "const_149(batch_norm_29.running_var)<256|float32|O>"
    idx: 124
    momentum: "0.100000"
    scale: "1"
    param_gamma: "const_146(batch_norm_29.weight)<256|float32|O>"
    epsilon: "0.000010"
    output_0: "batch_norm_29:0<1,256,14,14|float32|NCHW>"
    param_mean: "const_148(batch_norm_29.running_mean)<256|float32|O>"
  }
}
layer {
  name: "batch_norm_29.0"
  type: "get_item"
  top: "batch_norm_29.0"
  bottom: "batch_norm_29"
  layer_param {
    idx: 125
    input_0: "batch_norm_29:0<1,256,14,14|float32|NCHW>"
    output_0: "batch_norm_29.0:0<1,256,14,14|float32|NCHW>"
    index: "0"
  }
}
layer {
  name: "relu_26"
  type: "nn_relu"
  top: "relu_26"
  bottom: "batch_norm_29.0"
  layer_param {
    idx: 126
    input_0: "batch_norm_29.0:0<1,256,14,14|float32|NCHW>"
    output_0: "relu_26:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "conv2d_30"
  type: "nn_conv2d"
  top: "conv2d_30"
  bottom: "relu_26"
  layer_param {
    out_layout: "NCHW"
    out_dtype: "float32"
    groups: "1"
    kernel_layout: "OIHW"
    param_weight: "const_150(conv2d_30.weight)<1024,256,1,1|float32|OIHW>"
    strides: "1,1"
    idx: 127
    padding: "0,0,0,0"
    data_layout: "NCHW"
    dilation: "1,1"
    output_0: "conv2d_30:0<1,1024,14,14|float32|NCHW>"
    input_0: "relu_26:0<1,256,14,14|float32|NCHW>"
  }
}
layer {
  name: "batch_norm_30"
  type: "nn_batch_norm"
  top: "batch_norm_30"
  bottom: "conv2d_30"
  layer_param {
    input_0: "conv2d_30:0<1,1024,14,14|float32|NCHW>"
    center: "1"
